# Pandas

We have seen Numpy in the last section. It is good at performing math operation on 2d-arrays of numbers. But the major drawback is, it cannot deal with heterogenous values. So, Pandas dataframes are helpful in that aspect for storing different data types and referring the values like a dict in python instead of just referring each item with index.

[Link to Official Documentation](http://pandas.pydata.org/pandas-docs/version/0.23/dsintro.html)

## Series

Pandas series are almost same as nd arrays in numpy, with a additional inferencing ability with custom labels like *keys* in a *dictionary* in python.

In [0]:
# Import necessary libraries.
import numpy as np
import pandas as pd

In [2]:
#Example

series2 = pd.Series(data = [1,2,3], index = ['key1', 'key2', 'key3'])
series2

key1    1
key2    2
key3    3
dtype: int64

### Question 1

Convert a given dict to pd series.

[**Hint:** Use **.Series**]

In [0]:
d1 = {'a': 1, 'b': 2, 'c': 3} # Create a dictionary with key-value pair.

In [4]:
series1 = pd.Series(d1) # Dictionary to Pandas Series conversion.
series1 # view the new series

a    1
b    2
c    3
dtype: int64

You can directly use numpy functions on series.
### Question 2

Find the dot product of both the series create above


[ **Hint: ** Use **np.dot()** ]

In [5]:
# Returns the dot product of vectors series1 and series2. It can handle 2D arrays but considering them as matrix and will perform matrix multiplication.
np.dot(series1, series2)

14

## Dataframes

A dataframe is a table with labeled columns which can hold different types of data in each column.

In [6]:
# Example
d1 = {'a': [1,2,3], 'b': [3,4,5], 'c':[6,7,8] }
df1 = pd.DataFrame(d1)
df1

   a  b  c
0  1  3  6
1  2  4  7
2  3  5  8

### Question 3

Select second row in the above dataframe df1.

In [7]:
df1.loc[[1,]] # selects row=1 and all columns of df1.

   a  b  c
1  2  4  7

### Question 4

Select column c in second row of df1.

[ **Hint:** For using labels use **df.loc[row, column]**. For using numeric indexed use **df.iloc[]**. For using mixture of numeric indexes and labels use **df.ix[row, column]** ]

In [8]:
df1.loc[1, 'c'] # using df.loc[row, column], where row=1, and column='c'.

7

## Using Dataframes on a dataset

##### Using the mtcars dataset.

For the below set of questions, we will be using the cars data from [Motor Trend Car Road Tests](http://stat.ethz.ch/R-manual/R-devel/library/datasets/html/mtcars.html)

The data was extracted from the 1974 Motor Trend US magazine, and comprises fuel consumption and 10 aspects of automobile design and performance for 32 automobiles (1973â€“74 models). 


Details :
    
A data frame with 32 observations on 11 (numeric) variables.

[, 1] 	mpg 	Miles/(US) gallon

[, 2] 	cyl 	Number of cylinders

[, 3] 	disp 	Displacement (cu.in.)

[, 4] 	hp 	Gross horsepower

[, 5] 	drat 	Rear axle ratio

[, 6] 	wt 	Weight (1000 lbs)

[, 7] 	qsec 	1/4 mile time

[, 8] 	vs 	Engine (0 = V-shaped, 1 = straight)

[, 9] 	am 	Transmission (0 = automatic, 1 = manual)

[,10] 	gear 	Number of forward gears

[,11] 	carb 	Number of carburetors

In [0]:
# Reading a dataset from a csv file using pandas.
mtcars = pd.read_csv('/content/drive/My Drive/Colab Notebooks/data/mtcars.csv')
mtcars.index = mtcars['name']

Following questions are based on analysing a particular dataset using dataframes.

### Question 5

Check the type and dimensions of given dataset - mtcars.


[ **Hint:** Use **type()** and **df.shape** ]

In [10]:
mtcars.shape

(32, 12)

In [11]:
type(mtcars)

pandas.core.frame.DataFrame

### Question 6

Check the first 10 lines and last 10 lines of the given dataset- mtcars.

[**Hint:** Use **.head()** and **.tail()**]

In [12]:
mtcars.head(10)

                                name   mpg  cyl   disp  ...  vs  am  gear  carb
name                                                    ...
Mazda RX4                  Mazda RX4  21.0    6  160.0  ...   0   1     4     4
Mazda RX4 Wag          Mazda RX4 Wag  21.0    6  160.0  ...   0   1     4     4
Datsun 710                Datsun 710  22.8    4  108.0  ...   1   1     4     1
Hornet 4 Drive        Hornet 4 Drive  21.4    6  258.0  ...   1   0     3     1
Hornet Sportabout  Hornet Sportabout  18.7    8  360.0  ...   0   0     3     2
Valiant                      Valiant  18.1    6  225.0  ...   1   0     3     1
Duster 360                Duster 360  14.3    8  360.0  ...   0   0     3     4
Merc 240D                  Merc 240D  24.4    4  146.7  ...   1   0     4     2
Merc 230                    Merc 230  22.8    4  140.8  ...   1   0     4     2
Merc 280                    Merc 280  19.2    6  167.6  ...   1   0     4     4

[10 rows x 12 columns]

In [13]:
mtcars.tail(10)

                              name   mpg  cyl   disp  ...  vs  am  gear  carb
name                                                  ...
AMC Javelin            AMC Javelin  15.2    8  304.0  ...   0   0     3     2
Camaro Z28              Camaro Z28  13.3    8  350.0  ...   0   0     3     4
Pontiac Firebird  Pontiac Firebird  19.2    8  400.0  ...   0   0     3     2
Fiat X1-9                Fiat X1-9  27.3    4   79.0  ...   1   1     4     1
Porsche 914-2        Porsche 914-2  26.0    4  120.3  ...   0   1     5     2
Lotus Europa          Lotus Europa  30.4    4   95.1  ...   1   1     5     2
Ford Pantera L      Ford Pantera L  15.8    8  351.0  ...   0   1     5     4
Ferrari Dino          Ferrari Dino  19.7    6  145.0  ...   0   1     5     6
Maserati Bora        Maserati Bora  15.0    8  301.0  ...   0   1     5     8
Volvo 142E              Volvo 142E  21.4    4  121.0  ...   1   1     4     2

[10 rows x 12 columns]

### Question 7

Print all the column labels in the given dataset - mtcars.

[ **Hint:** Use **df.columns** ]

In [14]:
mtcars.columns

Index(['name', 'mpg', 'cyl', 'disp', 'hp', 'drat', 'wt', 'qsec', 'vs', 'am',
       'gear', 'carb'],
      dtype='object')

### Question 8

Select first 6 rows and 3 columns in mtcars dataframe.

**Hint: **  
mtcars.iloc[:,:] gives all rows and columns in the dataset.

In [15]:
mtcars.iloc[0:5,0:2]  # mtcars.ix[] can also used with proper index and label names, as .ix supports hybrid indexing.

                                name   mpg
name
Mazda RX4                  Mazda RX4  21.0
Mazda RX4 Wag          Mazda RX4 Wag  21.0
Datsun 710                Datsun 710  22.8
Hornet 4 Drive        Hornet 4 Drive  21.4
Hornet Sportabout  Hornet Sportabout  18.7

### Question 9

Select rows from name **Mazda RX4** to **Valiant** in the mtcars dataset and display only mpg and cyl values of those cars. 

**Hint:** Use df **.iloc[rows,columns]**

In [16]:
mtcars.iloc[0:6, 1:3]

                    mpg  cyl
name
Mazda RX4          21.0    6
Mazda RX4 Wag      21.0    6
Datsun 710         22.8    4
Hornet 4 Drive     21.4    6
Hornet Sportabout  18.7    8
Valiant            18.1    6